Revit 2027 API
AreaLoad.AreCurveLoopsValid Method
 Checks if curve loops are valid for creating an area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreCurveLoopsValid(
	IList<CurveLoop> loops
)
Public Shared Function AreCurveLoopsValid (
	loops As IList(Of CurveLoop)
) As Boolean
public:
static bool AreCurveLoopsValid(
	IList<CurveLoop^>^ loops
)
static member AreCurveLoopsValid :
        loops : IList<CurveLoop> -> bool
Parameters
loops IList<CurveLoop>
 The curve loops to be checked.
Return Value
Boolean
 Returns true if curve loops are ok, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace